{
  "irVersion": "1.0",
  "project": "h5pkit",
  "repository": "https://github.com/grokify/h5pkit",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify", "johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.5.0",
      "date": "2026-03-22",
      "highlights": [
        { "description": "Module renamed from `h5p-go` to `h5pkit`" },
        { "description": "TypeScript quiz editor (`@grokify/h5p-editor`) for browser-based editing" }
      ],
      "changed": [
        { "description": "Renamed module from `github.com/grokify/h5p-go` to `github.com/grokify/h5pkit`" },
        { "description": "Renamed repository from `h5p-go` to `h5pkit`" }
      ],
      "added": [
        { "description": "TypeScript quiz editor package in `ts/packages/editor/`" },
        { "description": "React component `QuizEditor` with ref-based API" },
        { "description": "Vanilla JS API via `createQuizEditor()` for CDN usage" },
        { "description": "Multiple Choice, True/False, Fill in Blanks question editors" },
        { "description": "Undo/redo support for editing operations" },
        { "description": "Real-time validation with detailed error messages" },
        { "description": "Light and dark theme support" }
      ],
      "documentation": [
        { "description": "TypeScript editor documentation in `docs/ts-editor/`" },
        { "description": "Updated homepage to feature both Go SDK and TypeScript editor" }
      ]
    },
    {
      "version": "v0.4.0",
      "date": "2026-03-15",
      "highlights": [
        { "description": "Extensions support for vendor-specific question metadata with h5pGo namespace" }
      ],
      "added": [
        { "description": "`Extensions` and `H5PGoExtension` types for question metadata", "commit": "94ece1e" },
        { "description": "Builder pattern methods: `WithTopic()`, `WithTags()`, `WithDifficulty()`, `WithLearningObjective()`, `WithSource()`", "commit": "94ece1e" },
        { "description": "`Extensions` field on `Question` and `MultiChoiceQuestion` structs", "commit": "94ece1e" },
        { "description": "`NewMultiChoiceQuestionWithExtensions()` and `WithExtensions()` helper methods", "commit": "94ece1e" },
        { "description": "Comprehensive tests for extensions JSON parsing and round-trip validation", "commit": "94ece1e" }
      ],
      "infrastructure": [
        { "description": "Update to shared CI workflows", "commit": "f267f6b" },
        { "description": "Rename workflow files for consistency", "commit": "7be8b91" }
      ],
      "dependencies": [
        { "description": "Bump actions/setup-go from 5 to 6", "commit": "f07e707" },
        { "description": "Bump actions/checkout from 5 to 6", "commit": "623e37c" },
        { "description": "Bump golangci/golangci-lint-action from 8 to 9", "commit": "e8f32f4" },
        { "description": "Bump github/codeql-action from 3 to 4", "commit": "2435ff9" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2025-09-02",
      "highlights": [
        { "description": "Semantics package with TrueFalse and Essay question type support" },
        { "description": "MkDocs documentation site with comprehensive guides" }
      ],
      "added": [
        { "description": "`semantics` package with individual semantics for TrueFalse and Essay question types", "commit": "0a26542" },
        { "description": "MkDocs documentation source in `docsrc/` directory", "commit": "67adc57" },
        { "description": "Generated documentation site in `docs/` directory", "commit": "66042b4" }
      ],
      "changed": [
        { "description": "Refactored tests for new filename conventions", "commit": "47f7444" }
      ],
      "documentation": [
        { "description": "API reference for builder, core-types, schemas, and semantics", "commit": "67adc57" },
        { "description": "Getting started guides: installation, quick-start, concepts", "commit": "67adc57" },
        { "description": "User guides: H5P packages, question sets, typed questions, validation", "commit": "67adc57" },
        { "description": "Reference documentation: file structure, H5P spec, standards", "commit": "67adc57" },
        { "description": "README refactored to use MkDocs structure", "commit": "75552d3" }
      ],
      "security": [
        { "description": "Add permissions to CI workflow for code scanning compliance", "commit": "70b6fec" },
        { "description": "Add permissions to lint workflow for code scanning compliance", "commit": "44bfab1" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2025-09-01",
      "highlights": [
        { "description": "Module renamed from `go-h5p` to `h5p-go` following Go naming conventions" }
      ],
      "changed": [
        { "description": "Renamed module from `github.com/grokify/go-h5p` to `github.com/grokify/h5p-go`", "commit": "b27dd94" }
      ],
      "documentation": [
        { "description": "Remove redundant shields from README", "commit": "6cad7a0" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2025-09-01",
      "highlights": [
        { "description": "Initial release with H5P QuestionSet parsing and typed question support" },
        { "description": "H5P package (zip file) management for creating and extracting H5P content" }
      ],
      "added": [
        { "description": "Core `QuestionSet` type with JSON parsing and serialization", "commit": "6d14533" },
        { "description": "H5P package (zip) management: create, extract, and manipulate H5P files", "commit": "a47df22" },
        { "description": "`schemas` package with MultiChoice question type and params", "commit": "3a7e9f0" },
        { "description": "`MultiChoiceQuestion` typed wrapper with `NewMultiChoiceQuestion()` factory", "commit": "3a7e9f0" },
        { "description": "`cmd/h5pparsequestionset` CLI tool for parsing H5P question sets", "commit": "9c07a4a" },
        { "description": "Question builder utilities for programmatic H5P content creation", "commit": "6d14533" }
      ],
      "documentation": [
        { "description": "Comprehensive README with usage examples and API documentation", "commit": "d5d99b3" },
        { "description": "Badge shields for CI status, Go Reference, and license", "commit": "1430281" },
        { "description": "\"Why H5P for Quizzes?\" guide explaining H5P benefits", "commit": "6bbf489" }
      ],
      "infrastructure": [
        { "description": "GitHub Actions CI workflows for build, lint, and SAST", "commit": "7746b68" },
        { "description": "Dependabot configuration for automated dependency updates", "commit": "7746b68" },
        { "description": "golangci-lint configuration", "commit": "7746b68" }
      ]
    }
  ]
}
